lilstagram/app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "updated_at", "text", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-04-05 19:44:07.664478"], ["updated_at", "2018-04-05 19:44:07.664478"], ["text", "hello"], ["user_id", 1], ["post_id", 1]]
---
	def create
		@comment = Comment.new(comment_params)
		@comment.post_id = params[:post_id]
		@comment.user_id = current_user.id

		@comment.save