app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY updated_at DESC
---
	def index
		@posts = Post.order('updated_at DESC')

INSERT INTO "posts" ("image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["image", "https://www.w3schools.com/howto/img_fjords.jpg"], ["user_id", 1], ["created_at", "2018-04-05 02:10:03.250669"], ["updated_at", "2018-04-05 02:10:03.250669"]]
---
	def create
		@post = current_user.posts.new(post_params)
		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "caption" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["caption", "Beautiful!"], ["updated_at", "2018-04-05 04:46:49.464297"], ["id", 1]]
---
	def update
		@post = Post.find(params[:id])
		if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
	def destroy
		Post.destroy(params['id'])